import asyncio
import os
import random

from aiogram import Bot, Dispatcher
from aiogram.filters import Command
from aiogram.types import (InlineKeyboardButton, InlineKeyboardMarkup, Message,
                           WebAppInfo)

bot = Bot(token=os.environ['BOT_TOKEN'])
dp = Dispatcher()

text = """
Давалке МСК стреляю сиги — ковбой
Я кинню тебя точно так же, только чуть-чуть другой
Стеснялась всё снимать, окей, прикрой ебальник рукой
Я смотрю в зеркало всё так же, но не стану собой
Люблю Москву, но заебали все московские шалавы
В уродстве вижу красоту
В уродстве моя красота
Теперь на «вы», ведь ты давно уже не та
Давай я тебя порежу, а ты мне выстрелишь в лоб
Мы психопаты (У-ау), флексим так, как будто завтра умрём
Но это вряд ли, поймал (Фью)
И белый дым, чё-то чернит потолок
На время завязал, теперь
Я курю так, как будто никогда не умел
Чувство то, что я пиздец отупел
Ты не стреляешь, давай дам прицел
Сумма большая, как будто я даун —
Бро, не могу думать сегодня
Ты всё ещё там, но не моя, ты всё ещё тут, но там не я
Мы делаем много, но, честно, я знаю, что буду непонят
Династия!
Первый миллион
Я первый чемпион, и мне стянуло кожу ртом
Вильчинский знает толк в этом, мы снимем на iPhone
Концерты из Уфы, мы пишем это на Samson
Я помню, мама говорила: «Выкинь нахуй микрофон»
Я первый чемпион, и мне стянуло кожу ртом
Креатор знает толк в этом, мы снимем на iPhone (Е-е-а)
Концерты из Москвы, мы пишем это на Samson
Я помню, мама говорила: «Выкинь нахуй микрофон»
Я мог остаться тенью, и всё было бы так же
Но захотелось стучать выше этих многоэтажек
Моя хуйня стала мамбл — так разбирай на цитаты
Твой друг чё тоже стал рэпер? Но продаёт Золо… а! (Ву)
Прости, но я немного на другом
Если прощу тебя сейчас, то не прощу себя потом
Да, мой диагноз — ненормальный, но психолог может врать
Помню, показывал свой рэп, но тебе было наплевать
А что сейчас? Забавно, как ты просишь со мной фотку
Никакого мит-н-грита, максимум могу дать в глотку (М-м, а)
Для меня стало нормальным слить пол-ляма на футболку
Мой любимый рэпер в прошлом пиздит мои наработки (Упс)
Первый миллион
Я первый чемпион, и мне стянуло кожу ртом
Вильчинский знает толк в этом, мы снимем на iPhone
Концерты из Уфы, мы пишем это на Samson
Я помню, мама говорила: «Выкинь нахуй микрофон»
Я первый чемпион, и мне стянуло кожу ртом
Креатор знает толк в этом, мы снимем на iPhone
Концерты из Москвы, мы пишем это на Samson
Я помню, мама говорила: «Выкинь нахуй микрофон» (tainiy-tainiy-tainiy-tainiy)
dexey!
"""

lirics = text.split('\n')

game_keyboard = InlineKeyboardMarkup(inline_keyboard=[[
    InlineKeyboardButton(text='Играть',
                         web_app=WebAppInfo(
                             url='https://justconnie.github.io/test/app.html'))
]])


@dp.message(Command('start'))
async def start(message: Message):
  await message.answer('Привяо')


@dp.message(Command('swaga'))
async def swaga(message: Message):
  await message.answer(random.choice(lirics))


@dp.message(Command('snake'))
async def snake(message: Message):
  await message.answer('змейка', reply_markup=game_keyboard)


async def main():
  await dp.start_polling(bot)


asyncio.run(main())
